content/topics/kreatin.md
+++
title = "Kreatin"
author = ["Victor Dorneanu"]
draft = false
+++

## Dosages {#dosages}

-   Based on Body Weight: For a person weighing around 180 pounds, **5 grams per
    day is recommended**. Heavier individuals may need 10-15 grams, while those
    lighter might need 1-5 grams.
-   No Loading Phase Needed: Contrary to early beliefs, a high dosage loading
    phase isn't necessary; benefits can be achieved at consistent lower dosages.


## Effects {#effects}


### Cognitive performance and brain health {#cognitive-performance-and-brain-health}

-   Neuronal Fuel Source: Creatine also serves as a fuel source for neurons,
    potentially enhancing cognitive functions.
-   Traumatic Brain Injury: There are indications that creatine might aid
    cognition after traumatic brain injury, though medical consultation is advised


### Physical Performance {#physical-performance}

-   Increased Power Output: Studies show creatine can increase power output in
    activities like sprinting, running, jumping, and weightlifting by 1% to 20%.
-   Hydration and Muscle Mass: Creatine enhances the body's ability to hydrate
    cells, indirectly aiding in muscle mass increase.
-   Reduction in Fatigue: Multiple studies indicate creatine's role in reducing
    fatigue.


### Other effects {#other-effects}

-   Influence on Hormones: Creatine can increase levels of dihydrotestosterone
    (DHT), a potent androgen, which might affect strength, libido, and hair
    patterns.
-   Varied Effects on Hair Growth: While some may experience hair loss or
    accelerated beard growth, these effects are not universal.


## Sources {#sources}

-   2023-12-08 ◦ [Science of Muscle Growth, Increasing Strength &amp; Muscular Recovery - YouTube](https://www.youtube.com/watch?v=XLr2RKoD-oY&t=411s)


## Resources {#resources}

-   <https://www.sunday.de/creatin-monohydrat-pulver.html>
